// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： LED
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.4			TKR			新規（ファイルのインクルード）
// *************************************************************************/
// 多重コンパイル禁止
#ifndef _HAL_LED_H
#define _HAL_LED_H

//**************************************************
// インクルードファイル（include）
//**************************************************


//**************************************************
// 定義（define）
//**************************************************

//**************************************************
// 列挙体（enum）
//**************************************************
typedef enum{
	LED0 = 0,	// デバッグLED0
	LED1,		// デバッグLED1
	LED2,		// デバッグLED2
	LED3,		// デバッグLED3
	LED4,		// デバッグLED4
	
	LED_SYS,		// デバッグLED5（システム確認用）
	LED_BATT		// デバッグLED6（バッテリ確認用）
}enLED_ID;

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
PUBLIC void LED_init( void );
PUBLIC void LED_on( enLED_ID en_id );
PUBLIC void LED_onAll( void );
PUBLIC void LED_off( enLED_ID en_id );
PUBLIC void LED_offAll( void );
PUBLIC void LED_on_multi( CHAR c_num );


#endif
