// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： ENC
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.4			TKR			新規（ファイルのインクルード）
// *************************************************************************/
//**************************************************
// インクルードファイル（include）
//**************************************************
#include <typedefine.h>					// 定義
#include <common_define.h>				// 共通定義
#include <iodefine.h>					// I/O
#include <stdio.h>						// 標準入出力

#include <hal_led.h>					// LED
#include <hal_enc.h>                    // ENC

//**************************************************
// 定義（define）
//**************************************************
#define		ENC_RESET_VAL		(32768)					// エンコーダの中間値
#define		ENC_L_TSTR			(TPUA.TSTR.BIT.CST1)	// 左エンコーダパルスカウント開始(1717仕様)
#define		ENC_R_TSTR			(TPUA.TSTR.BIT.CST2)	// 右エンコーダパルスカウント開始(1717仕様)
#define		ENC_L_TCNT			(TPU1.TCNT)				// 左エンコーダパルス数(1717仕様)
#define		ENC_R_TCNT			(TPU2.TCNT)				// 右エンコーダパルス数(1717仕様)

//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
extern PUBLIC void TIME_wait(ULONG ul_time);


// *************************************************************************
//   機能		： エンコーダのカウントを開始する
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.4.14			TKR			新規
// *************************************************************************/
PUBLIC void ENC_Sta( void )
{
	ENC_R_TSTR = ON;		// カウント開始
	ENC_L_TSTR = ON;		// カウント開始
}

// *************************************************************************
//   機能		： エンコーダのカウントを停止する
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.4.14			TKR			新規
// *************************************************************************/
PUBLIC void ENC_Stop( void )
{
	ENC_R_TSTR = OFF;		// カウント停止
	ENC_L_TSTR = OFF;		// カウント停止
}

// *************************************************************************
//   機能		： エンコーダのカウントをクリア
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.4.14			TKR			新規
// *************************************************************************/
PUBLIC void ENC_clr( void )
{
	ENC_R_TCNT = ENC_RESET_VAL;
	ENC_L_TCNT = ENC_RESET_VAL;
}

// *************************************************************************
//   機能		： エンコーダのカウント値（パルス数）を取得する
//   注意		： なし
//   メモ		： 中間値からの差分
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2013.12.03			外川			新規
//		v2.0		2018.9.9			吉田			1717仕様に変更
// *************************************************************************/
PUBLIC void ENC_GetDiv( LONG* p_r, LONG* p_l )
{
	LONG l_cntR = (LONG)ENC_R_TCNT;
	LONG l_cntL = (LONG)ENC_L_TCNT;
	
	ENC_clr();		// カウント値リセット
	
	*p_r = ENC_RESET_VAL - l_cntR;		// 右モータ
	*p_l = l_cntL - ENC_RESET_VAL;		// 左モータ
}

// *************************************************************************
//   機能		： エンコーダの値を表示する
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
//   その他　　	： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.5.17			TKR			新規
// *************************************************************************/
PUBLIC void ENC_Check( void ){
	
	LED_offAll();
	
	while(1){
		printf("エンコーダ [R]=%d [L]=%d \r", ENC_R_TCNT, ENC_L_TCNT);
		
		TIME_wait( 50 );
	}	
}