// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： Battery
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規（ファイルのインクルード）
// *************************************************************************/

//**************************************************
// インクルードファイル（include）
//**************************************************
#include <iodefine.h>		// I/O
#include <typedefine.h>		// 定義
#include <stdio.h>			// 標準ライブラリ

#include <hal_sci.h>		// SCI
#include <hal_led.h>		// LED
#include <hal_battery.h>	// バッテリー

//**************************************************
// 定義（define）
//**************************************************
#define	BAT_GOOD		(7900.0f)		// 残量減ってきた：3.7V(1cell)
#define	BAT_LOW			(7800.0f)		// 残量やばい：3.6V(1cell)



//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************
PRIVATE	USHORT	us_BatLvAve = 4096;									// バッテリ平均値（AD変換の最大値で初期化）


//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
extern PUBLIC void TIME_wait(ULONG ul_time);

// *************************************************************************
//   機能		： バッテリ電圧を取得する
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： 電圧[mV]
// **************************    履    歴    *******************************
// 		v1.0		2019.4.2			TKR			新規
// *************************************************************************/
PUBLIC FLOAT BAT_getLv( void ){
	
	FLOAT f_val		= (FLOAT)( us_BatLvAve + 1 );
	
	return ( f_val / 4096 * 3300 * 4.0f );
}

	
// *************************************************************************
//   機能		： バッテリ監視用ポーリング関数
//   注意		： なし
//   メモ		： 割り込みから実行される
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規
// *************************************************************************/
PUBLIC void BAT_Pol( void )
{

	static	USHORT	us_BatLv[5] = { 4095, 4095, 4095, 4095, 4095 };		// バッテリレベル
	FLOAT	f_temp	= 0;
	
	
	/* ================================================== */
	/*  平均値を取得するため、データのバッファ処理を行う  */
	/* ================================================== */
	us_BatLv[4] = us_BatLv[3];
	us_BatLv[3] = us_BatLv[2];
	us_BatLv[2] = us_BatLv[1];
	us_BatLv[1] = us_BatLv[0];
	
	/* 最新の値を格納 */
	S12AD.ADANS0.WORD 		= 0x0010;		// AN4を選択
	S12AD.ADCSR.BIT.ADST	= 1;			// AD変換開始
	while(S12AD.ADCSR.BIT.ADST == 1);		// AD変換待ち
	us_BatLv[0]				= S12AD.ADDR4;	// AD変換データ取得
	
	/* 電圧平均化 */
	us_BatLvAve = ( us_BatLv[0] + us_BatLv[1] + us_BatLv[2] + us_BatLv[3] + us_BatLv[4] ) / 5;
	
	/* 電圧値取得 */
	f_temp	= BAT_getLv(); 
	
	/* ======================= */
	/*  残量に応じてLEDを表示  */
	/* ======================= */
	if( f_temp < BAT_LOW ) {			// 残量やばい！！（赤色）
		LED_on(LED_BATT);
		LED_off(LED_SYS);
		// ブザー鳴らす
	}
	else if( f_temp < BAT_GOOD ) {		// 残量減ってきた（黄色）
		LED_off(LED_BATT);
		LED_on(LED_SYS);
	}
	else{									// 残量問題なし（光らない）
		LED_off(LED_BATT);
		LED_off(LED_SYS);
	}
	
}
	
// *************************************************************************
//   機能		： バッテリ電圧を表示する
//   注意		： なし
//   メモ		： 割り込みから実行される
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規
// *************************************************************************/
PUBLIC void BAT_Check(void){

	LED_onAll();
	
	while(1){
		printf("[電源電圧] %5.2f[V]\n\r",BAT_getLv()/1000);
		TIME_wait(500);
	}
}