// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： SCI
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規（ファイルのインクルード）
// *************************************************************************/

//**************************************************
// インクルードファイル（include）
//**************************************************
#include <iodefine.h>		// I/O
#include <typedefine.h>		// 定義
#include <stdio.h>							// 標準入出力
#include <hal_sci.h>		// SCI


//**************************************************
// 定義（define）
//**************************************************

//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************


// *************************************************************************
//   機能		： SCIの初期設定をする。
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.2.5			TKR				新規
// *************************************************************************/
PUBLIC void SCI1_init( void ){
	
	
	SYSTEM.PRCR.WORD = 0xa502;		// PRC1書き込み許可
	MSTP(SCI1) = 0;					// 電力供給許可(SCI用)		
	SYSTEM.PRCR.WORD = 0xa500;		// PRC1書き込み禁止	

	SCI1.SCR.BYTE	= 0x00;		// SCI機能をdisanable
	while( 0x00 != (SCI1.SCR.BYTE & 0xf0 ) );
	
	/*↓消す鴨*/
#if 0
	PORT2.PODR.BIT.B6	= 1;
	PORT2.PDR.BIT.B6	= 1;	// P26：出力
	PORT3.PDR.BIT.B0	= 0;	// P30：入力
	PORT2.PMR.BIT.B6	= 0;	// P26：汎用入出力
	PORT3.PMR.BIT.B0	= 0;	// P30：汎用入出力
#endif
	/*===*/
	
	MPC.PWPR.BIT.B0WI	= 0;		// PFSWEビットへの書き込み許可
	MPC.PWPR.BIT.PFSWE	= 1;		// PFSレジスタの書き込み許可
	MPC.P26PFS.BIT.PSEL	= 0x0a;		// P26：TXD1
	MPC.P30PFS.BIT.PSEL	= 0x0a;		// P30：RXD1
	MPC.PWPR.BIT.PFSWE	= 0;		// PFSレジスタの書き込み禁止
	MPC.PWPR.BIT.B0WI	= 1;		// PFSWEビットへの書き込み禁止
	
	SCI1.SCR.BIT.CKE	= 0;
	SCI1.SMR.BYTE		= 0x00;
	SCI1.SCMR.BYTE		= 0xf2;
	
	SCI1.SEMR.BYTE		= 0x10;
	SCI1.BRR			= 51;
	
	PORT2.PMR.BIT.B6	= 1;	// P26：周辺機能
	PORT3.PMR.BIT.B0	= 1;	// P30：周辺機能
	
	SCI1.SCR.BYTE		= 0x30;

	//IR(SCI1,TEI1)		= 0;
	//IR(SCI1,TXI1)		= 0;
	IEN(SCI1,TXI1)		= 1;
	IEN(SCI1,RXI1)		= 1;

	ICU.IPR[217].BIT.IPR	= 5;
	
}

// *************************************************************************
//   機能		： 1文字出力。
//   注意		： なし
//   メモ		： SCI1を使用
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC void SCI_putch(char data){
	
	while(SCI1.SSR.BIT.TEND == 0){}		// 送信バッファの空きチェック
	
	SCI1.TDR	 		= data;		// 送信データの格納
	SCI1.SSR.BIT.TEND 	= 0;
}

// *************************************************************************
//   機能		： 文字列出力。
//   注意		： なし
//   メモ		： "\n"のみで"CR+LF"出力を行う
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC void SCI_puts(char *buffer){
	
	char data;
	
	/* nullまで出力 */
	while( ( data = *( buffer++ ) ) != 0 ){
		
		/* データの値に応じて出力を変える */
		if( data == 0x0a ){		// LFコードなら
			SCI_putch(0x0a);	// LF(改行)
			SCI_putch(0x0d);	// CR(復帰)
		}else{
			SCI_putch(data);	// 1文字出力	
		}
	}
}
			

// *************************************************************************
//   機能		： 文字列出力。
//   注意		： なし
//   メモ		： 文字列長さ指定付き"\n"のみで"CR+LF"出力を行う
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC void SCI_putsL(char *buffer, int len){
	
	char data;
	int i;
	
	/* nullまで出力 */
	for( i = 0; i < len; i++ ){
		data = *(buffer++);
		
		/* データの値に応じて出力を変える */
		if( data == 0x0a ){		// LFコードなら
			SCI_putch(0x0a);	// LF(改行)
			SCI_putch(0x0d);	// CR(復帰)
		}else{
			SCI_putch(data);	// 1文字出力	
		}
	}
}

// *************************************************************************
//   機能		： 1文字出力用ラッパー関数
//   注意		： なし
//   メモ		： printfに使う
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.15			TKR				新規
// *************************************************************************/
PUBLIC void charput(unsigned char data){
	
	SCI_putch(data);
}	

// *************************************************************************
//   機能		： 入力バッファをチェック
//   注意		： なし
//   メモ		： なし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC int SCI_chkRecv(void){
	
	/* データの受信チェック */
	if( IR(SCI1,RXI1) == 1 ){
		return 1;	// 受信データあり
	}else{
		return 0;	// 受信データなし
	}
}	

// *************************************************************************
//   機能		： 1文字入力。
//   注意		： なし
//   メモ		： SCI1を使用
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC char SCI_getch(void){
	
	char data;
	
	while(1){
		/*データの受信チェック*/
		if( SCI_chkRecv() ){
			data = SCI1.RDR;		// データ受信
			IR(SCI1,RXI1) = 0;
			break;
		}
	}
	
	return data;
}

// *************************************************************************
//   機能		： 1文字入力(unsigned char版)
//   注意		： なし
//   メモ		： エコーバックなし
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC unsigned char SCI_getch_uc(void){
	
	unsigned char data;
	
	while(1){
		/*データの受信チェック*/
		if( SCI_chkRecv() ){
			data = SCI1.RDR;		// データ受信
			IR(SCI1,RXI1) = 0;
			break;
		}
	}
	
	return data;
}

// *************************************************************************
//   機能		： 文字列入力。
//   注意		： なし
//   メモ		： CRコードまで，最大255字，エコーバックあり
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC int SCI_gets(char *buffer){
	
	char data;
	int i = 0;
	
	while(1){
		data = SCI_getch();		// 1文字入力
		*buffer = data;
		SCI_putch(data);		// 1文字出力(エコーバック)
		buffer++;
		i++;
		if( i > 255 )		break;	// 最大文字数到達
		if( data == 0x0D)	break;	// CRコードまで達した
	}
	
	*buffer = (unsigned char)0;		// null
	
	return i;	// 文字数
}
			

// *************************************************************************
//   機能		： 1文字入力用ラッパー関数
//   注意		： なし
//   メモ		： scanfに使う
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
//		v1.0		2019.3.14			TKR				新規
// *************************************************************************/
PUBLIC unsigned char charget(void){
	
	return SCI_getch_uc();

}