// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： SCI
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規（ファイルのインクルード）
// *************************************************************************/
#ifndef _HAL_SPI_H
#define	_HAL_SPI_H

//**************************************************
// インクルードファイル（include）
//**************************************************
#include <typedefine.h>					// 定義
#include <common_define.h>				// 共通定義
#include <iodefine.h>					// I/O
#include <stdio.h>						// 標準入出力

//**************************************************
// 定義（define）
//**************************************************
/* SPI */
#define		SPI_R				( 0x8000 )							// SPI通信での読み込み
#define		SPI_W				( 0x0000 )							// SPI通信での書き込み

//**************************************************
// 列挙体（enum）
//**************************************************
typedef enum{
	SPI_IDLE	= 0,		// IDLE状態
	SPI_SND,				// 送信状態
	SPI_RCV,				// 受信状態
	SPI_STATE_MAX
}enSPI_STATE;

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// ポインタ関数
//**************************************************
/* SPI通信 */
typedef void (*FUNC_PTR)( void );

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
PUBLIC void SPI_init(void);
PUBLIC USHORT SPI_Recv(USHORT address);
PUBLIC void	SPI_TXI(void);
PUBLIC void SPI_staSetData( USHORT us_adr, USHORT us_val );
PUBLIC void SPI_RXI( void );
PUBLIC void SPI_staGetData( USHORT us_adr );
PUBLIC void	SPI_III(void);
PUBLIC BOOL SPI_isIdle(void);

#endif