// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： SCI
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規（ファイルのインクルード）
// *************************************************************************/
#ifndef _HAL_SCI_H
#define	_HAL_SCI_H

//**************************************************
// インクルードファイル（include）
//**************************************************
#include <stdio.h>							// 標準入出力

//**************************************************
// 定義（define）
//**************************************************

//**************************************************
// 列挙体（enum）
//**************************************************

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
PUBLIC void SCI1_init( void );
PUBLIC void SCI_putch(char data);
PUBLIC void SCI_puts(char *buffer);
PUBLIC void SCI_putsL(char *buffer, int len);
PUBLIC void charput(unsigned char data);
PUBLIC int SCI_chkRecv(void);
PUBLIC char SCI_getch(void);
PUBLIC unsigned char SCI_getch_uc(void);
PUBLIC int SCI_gets(char *buffer);
PUBLIC unsigned char charget(void);




#endif