// *************************************************************************
//   ロボット名	： Baharat（バハラット）
//   概要		： サンシャインのHAL（ハードウエア抽象層）ファイル
//   注意		： なし
//   メモ		： MODE
//   引数		： なし
//   返り値		： なし
// **************************    履    歴    *******************************
// 		v1.0		2019.2.5			TKR			新規
// *************************************************************************/
//多重コンパイル禁止
#ifndef	_MODE_H
#define	_MODE_H

//**************************************************
// インクルードファイル（include）
//**************************************************
#include <typedefine.h>						// 定義
#include <iodefine.h>						// I/O
#include <stdio.h>							// 標準入出力

//**************************************************
// 定義（define）
//**************************************************
#define		SW_INC_PIN	(PORT3.PIDR.BIT.B1)
#define		SW_EXE_PIN	(PORT2.PIDR.BIT.B7)
#define		SW_ON		(OFF)
#define		SW_OFF		(ON)

#define		SW_CHATTERING_WAIT	(200)		// SWのチャタリング対策


//**************************************************
// 列挙体（enum）
//**************************************************
typedef enum{
	MODE_0 = 0,
	MODE_1,
	MODE_2,
	MODE_3,
	MODE_4,
	MODE_5,
	MODE_6,
	MODE_7,
	MODE_8,
	MODE_MAX
}enMODE;

//**************************************************
// 構造体（struct）
//**************************************************

//**************************************************
// グローバル変数
//**************************************************

//**************************************************
// プロトタイプ宣言（ファイル内で必要なものだけ記述）
//**************************************************
PUBLIC void MODE_inc(void);
PUBLIC void	MODE_exe( void );

#endif